Revit 2024 API
ViewExportedEventArgs Class
 The event arguments used by the ViewExported event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class ViewExportedEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class ViewExportedEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class ViewExportedEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ViewExportedEventArgs
See Also
ViewExportedEventArgs Members
Autodesk.Revit.DB.Events Namespace